#DataFrames

In [27]:
import pandas as pd
import numpy as np

In [28]:
df = pd.DataFrame({"name":"Harnoor","age":23,"dob":"2/12/2012"},index=[1])
df

      name  age        dob
1  Harnoor   23  2/12/2012

In [29]:
df = pd.DataFrame([[1,2,3],[4,5,6],["hello","hi","namaste"]])
df

       0   1        2
0      1   2        3
1      4   5        6
2  hello  hi  namaste

In [30]:
df1 = pd.DataFrame([["A",20,"2-1-2001"],["B",21,"3-1-2002"],["C",22,"4-3-2003"]],columns=["Name","Age","DoB"],index=[1,2,3])
df1

  Name  Age       DoB
1    A   20  2-1-2001
2    B   21  3-1-2002
3    C   22  4-3-2003

In [31]:
df2= pd.DataFrame({"Name":["A","B","C"],"Age":23,"DoB":"4-9-2001"})
df2

  Name  Age       DoB
0    A   23  4-9-2001
1    B   23  4-9-2001
2    C   23  4-9-2001

In [32]:
df1["Name"]

1    A
2    B
3    C
Name: Name, dtype: object

In [33]:
df1.Name

1    A
2    B
3    C
Name: Name, dtype: object

In [34]:
df1.Age.sum()

np.int64(63)

In [35]:
df1["Name"][3]

'C'

In [36]:
df1["Name"]

1    A
2    B
3    C
Name: Name, dtype: object

In [37]:
df1.ndim

2

In [38]:
df1.shape

(3, 3)

In [39]:
df1

  Name  Age       DoB
1    A   20  2-1-2001
2    B   21  3-1-2002
3    C   22  4-3-2003

In [40]:
df = pd.DataFrame({"Name":["A","B","C","D","D"],"Age":[20,23,24,20,20],"Marks":[98,91,96,98,98],"Branch":["it","Ece","Cse","it","it"]})
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it
4    D   20     98     it

In [41]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [42]:
df.drop_duplicates(inplace=True,ignore_index=True)
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [43]:
df1 = pd.DataFrame({"Name":["E","F","G","H","I"],"Age":[20,23,24,20,20],"Marks":[98,91,96,98,98],"Branch":["it","Ece","Cse","it","it"]})
df1

  Name  Age  Marks Branch
0    E   20     98     it
1    F   23     91    Ece
2    G   24     96    Cse
3    H   20     98     it
4    I   20     98     it

In [44]:
df4 = pd.concat([df,df1],ignore_index=True)
df4

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it
4    E   20     98     it
5    F   23     91    Ece
6    G   24     96    Cse
7    H   20     98     it
8    I   20     98     it

In [45]:
df3 = pd.DataFrame({"Percentage%":[98,99,100,72,83],"Marks":[72,73,74,75,76]})
df3

   Percentage%  Marks
0           98     72
1           99     73
2          100     74
3           72     75
4           83     76

In [46]:
df4 = pd.concat([df,df3])
df4

  Name   Age  Marks Branch  Percentage%
0    A  20.0     98     it          NaN
1    B  23.0     91    Ece          NaN
2    C  24.0     96    Cse          NaN
3    D  20.0     98     it          NaN
0  NaN   NaN     72    NaN         98.0
1  NaN   NaN     73    NaN         99.0
2  NaN   NaN     74    NaN        100.0
3  NaN   NaN     75    NaN         72.0
4  NaN   NaN     76    NaN         83.0

In [47]:
df4 = pd.concat([df,df3],axis=1)
df4

  Name   Age  Marks Branch  Percentage%  Marks
0    A  20.0   98.0     it           98     72
1    B  23.0   91.0    Ece           99     73
2    C  24.0   96.0    Cse          100     74
3    D  20.0   98.0     it           72     75
4  NaN   NaN    NaN    NaN           83     76

In [59]:
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [49]:
df1

  Name  Age  Marks Branch
0    E   20     98     it
1    F   23     91    Ece
2    G   24     96    Cse
3    H   20     98     it
4    I   20     98     it

In [50]:
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [60]:
df.insert(column="RollNo.",value=[1,2,3,4],loc=1)
df

  Name  RollNo.  Age  Marks Branch
0    A        1   20     98     it
1    B        2   23     91    Ece
2    C        3   24     96    Cse
3    D        4   20     98     it

In [52]:
df

  Name  RollNo.  Age  Marks Branch
0    A        1   20     98     it
1    B        2   23     91    Ece
2    C        3   24     96    Cse
3    D        4   20     98     it

In [53]:
df=df.drop("RollNo.",axis=1)
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [54]:
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [55]:
df = df.rename(columns={"marks":"Marks","age":"Age"})
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Marks   4 non-null      int64
 3   Branch  4 non-null      object
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [57]:
df.describe()

             Age      Marks
count   4.000000   4.000000
mean   21.750000  95.750000
std     2.061553   3.304038
min    20.000000  91.000000
25%    20.000000  94.750000
50%    21.500000  97.000000
75%    23.250000  98.000000
max    24.000000  98.000000

In [58]:
df.age.apply(lambda x:x*x)

AttributeError: 'DataFrame' object has no attribute 'age'

In [91]:
df["marks"] = df.marks.apply(lambda x:x*x)
df

  Name  age     marks Branch
0    A   20  92236816     it
1    B   23  68574961    Ece
2    C   24  84934656    Cse
3    D   20  92236816     it
4    D   20  92236816     it

In [79]:
df = pd.DataFrame({"Name":["A","B","C","D"],"Age":[20,23,24,20],"Marks":[98,91,96,98],"Branch":["it","Ece","Cse","it"]})
df

  Name  Age  Marks Branch
0    A   20     98     it
1    B   23     91    Ece
2    C   24     96    Cse
3    D   20     98     it

In [80]:
df["Gender"]= ["Female","Male","Female","Male"]
df

  Name  Age  Marks Branch  Gender
0    A   20     98     it  Female
1    B   23     91    Ece    Male
2    C   24     96    Cse  Female
3    D   20     98     it    Male

In [81]:
df["Gender"] = df.Gender.map({"Male":"M","Female":"F"})
df

  Name  Age  Marks Branch Gender
0    A   20     98     it      F
1    B   23     91    Ece      M
2    C   24     96    Cse      F
3    D   20     98     it      M